# ATFContainedUnsupportedGeometricData Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportFailures..::..ATFContainedUnsupportedGeometricData Property
BuiltInFailures..::..ImportFailures Class See Also
---
The original model contains unsupported geometric data such as curves or points.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ATFContainedUnsupportedGeometricData { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ATFContainedUnsupportedGeometricData As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ATFContainedUnsupportedGeometricData {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImportFailures Class
Autodesk.Revit.DB Namespace